import re

print("""見出し語から315の番号を出力します。
入力は歴史的仮名遣いで。
但し「ゐ」は「い」で代用可能です。
----------------------------""")
print()


l1 = ["みる","みす","みゆ","かいまみる","よばふ","すく","わたる","ありく","おこなふ","なやむ",
"おこたる","おくる","ながむ","ときめく","かしづく","めづ","おどろく","こうず","おぼゆ","きこゆ",
r"まもる|まぼる","たのむ","かづく","ののしる","やる","いらふ","にほふ","あきらむ",
"ねんず","まうく",r"ゐる|いる","ぐす","ふ","さる","ものす","ならふ","しのぶ","わぶ","をかし",
"よろし","ありがたし","つきづきし","なまめかし","めでたし","うるはし","やむごとなし",
"おとなし","ゆかし","なつかし","はづかし","こころにくし","うつくし","かなし","らうたし","めやすし",
"あやし","さうざうし","つれなし","なめし","おどろおどろし","うし","むつかし","すさまじ","びんなし",
"いとほし","いはけなし","つらし","ところせし","うしろめたし","かたはらいたし","わりなし","ほいなし",
"あさまし","めざまし","いみじ","ゆゆし","やさし","しるし","とし","ゆくりなし","おぼつかなし","こころもとなし",
"あはれなり","つれづれなり",r"すずろなり|そぞろなり",r"まめなり|まめやかなり","あだなり","いたづらなり",
"いうなり","あてなり","あからさまなり","みそかなり","おろかなり","をこなり","むげなり","なかなかなり","て",
"ふみ","せうそこ","あそび","うへ","おほやけ","うち","おまへ","みゆき","たより","ものがたり","ためし",
"いそぎ","ようい","かたち","かげ","けしき","こころざし","ほい","こと","わざ","よろづ","ことわり",
r"ひがこと|ひがごと","そらごと","しるし","れう","ろく","としごろ","つとめて",r"よ|よのなか",r"いかで|いかでか",
r"いかが|いかに",r"など|などか|などて|なじかは","いつしか","おのづから","なほ","いとど","げに","かく","さ","しか",
"と","やがて","すなはち","やうやう",r"やをら|やはら",r"なかなか|なかなかに","さすがに","かたみに",
"うたて","なべて","わざと","あまた",r"ここら|そこら","え","な","おほかた","さらに","よに",
"たえて","つゆ",r"ゆめ|ゆめゆめ","つやつや","をさをさ","よも","あなかしこ","ためらふ","やすらふ",
"かたらふ","すむ","やむ","うつろふ","みいだす","もてなす","あつかふ","あくがる","あふ","しほたる",
"かきくらす","まどふ","たばかる","すさぶ","すまふ","まねぶ","ねぶ","おきつ","うれふ","むすぶ",
"とぶらふ","やつす","さはる","かしこまる","かこつ","わく","つつむ","あらまほし","らうらうじ",
"うるせし","はかばかし","をさをさし","さうなし","くまなし","ずちなし","さがなし","あいなし",
"まさなし","はかなし","こころづきなし","あへなし","おほけなし","よしなし","はしたなし","しどけなし",
"いぎたなし","ひとわろし","いぶせし","くちをし","あたらし","ねたし","こちたし","けし","わびし",
"こころぐるし","まだし","さかし","まばゆし","かたじけなし","かしこし","しげし","すごし",
"いたし","おぼろけなり","なのめなり",r"きよらなり|けうらなり","まほなり","あらはなり","あながちなり",
"せちなり","とみなり","うちつけなり","さらなり",r"ねむごろなり|ねんごろなり","おいらかなり",
"あやにくなり","おぼえ","ひま","いとま","ざへ","よろこび","こころばへ","こころづくし","そこ",
"ここ","かれ","それ","これ","あなた","そなた","こなた","そのかみ","せうと",r"おとうと|おとと",
"いも","つま","はらから","かたへ","ほど","かぎり","きは","ついで","さた","とが","け",
"よし","やう","ちぎり","ほだし","あやめ","うつつ","あるじ","ふるさと","さて","さながら",
"いま","せめて",r"むべ|うべ","かつ","ひねもす","かまへて","あへて",r"かけて|かけても","さだめて",
r"のたまふ|のたまはす","おほす",r"きこゆ|きこえさす","まうす","そうす","けいす","うけたまはる",
"たまふ","たまはす","たまはる","めす",r"おぼす|おぼしめす","おほとのごもる",r"さぶらふ|さうらふ",
"はべり","たてまつる",r"まゐらす|まいらす",r"まゐる|まいる|まうづ",r"まかる|まかづ","あそばす",
r"つかまつる|つかうまつる","きこしめす","しろしめす",r"おはす|おはします",r"います|ます|まします|いますかり","ごらんず"]

while 1:
  word = input("ひらがな入力:")
  for _ in l1:
    if re.fullmatch(_, word):
      if word != "しるし":
        print("{}: {}".format(word, l1.index(_)+1))
        break
      else:
        print("しるし(形): 78")
        print("しるし(名): 122")
        break
  else:
    print("{}: NotFound".format(word))
  
  print()
